app/controllers/save_message_controller.rb

INSERT INTO "messages" ("idmessage", "message", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["idmessage", "bdd626a8-891e-4dad-9c46-69bd00153c5d"], ["message", "456"], ["password", "654"], ["created_at", "2018-06-10 00:14:41.093850"], ["updated_at", "2018-06-10 00:14:41.093850"]]
---
  def save
    message_uuid = SecureRandom.uuid
    #encrypted_pword = BCrypt::Password.create(params[:pword])
    encrypted_pword = params[:pword];


    message_data = {idmessage: message_uuid, message: params[:secret], password: encrypted_pword}
    message = Message.new(message_data)
    message.save