app/controllers/view_message_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."idmessage" = ?  ORDER BY "messages"."id" ASC LIMIT 1  [["idmessage", "a74b833d-e6f5-4ade-8ebb-4d48dddb8ad2"]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
---
  def view
    message = Message.where(idmessage: params[:idmessage]).first
    password = params[:pword]
    if password == message.password
      @message_text = message.message
      @error = false
      message.destroy

SELECT  "messages".* FROM "messages" WHERE "messages"."idmessage" = ?  ORDER BY "messages"."id" ASC LIMIT 1  [["idmessage", "2df40f25-8f4e-4c3c-b598-4da4b94c8093"]]
---
  def unlock
    @idmessage = params[:idmessage]
    message = Message.where(idmessage: params[:idmessage]).first